import React from "react";
import bgJoinUs from "../../img/other-content/my.jpg";
import shape1 from "../../img/other-content/shape.png";
import shape2 from "../../img/other-content/shape-1.png";
import { NavLink } from "react-router-dom";

export const Join = () => {
  return (
    <main className="max-w-[1500px] mx-auto">
      <section className="relative max-w-full h-auto bg-Blue400 rounded-[20px] mt-[50px] py-[32px] px-[25px] md:py-[20px] md:px-[10px]">
        <h1 className="text-[#232323] uppercase font-Bluecurve text-[120px] textwrap xlbig:text-[100px] xl:text-[80px] lg:text-[50px] md:text-[27px]">
          Присоединяйся к нам!
        </h1>
        <div className="max-w-[740px] flex justify-between items-center xlbig:flex-col xlbig:items-start">
          <p className="text-[#363539] text-[50px] uppercase font-Bluecurve textwrap lg:text-[30px] md:text-[20px] md:max-w-[438px]">
            смотри любимые аниме с комфортом!
          </p>
          <NavLink to="/registration/">
            <p className="md:hidden py-[21px] px-[31px] bg-heroGradient text-white text-[16px] font-GothamPro font-light rounded-[50px] hover:scale-110 transition-transform xlbig:mt-[20px]">
              Регистрация
            </p>
          </NavLink>
        </div>
      </section>
      <section className="grid grid-cols-2 mt-[-200px] xl:grid xl:grid-cols-1">
        <div className="mt-[250px] lg:mt-[200px]">
          <aside className="flex gap-[36px] items-center mt-[30px] ml-[22px] md:gap-[20px] md:ml-[0px]">
            {/* ДИВ ПОД СВГ ЭЛЕМЕНТ ЧТОБЫ НЕ СДАВЛИВАЛО!!!! */}
            <div className="">
              <svg
                className="lg:max-w-[50px] h-full md:max-w-[40px]"
                width="60"
                height="60"
                viewBox="0 0 60 60"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="30" cy="29.9999" r="30" fill="#054ade" />
                <path
                  d="M42.4217 38.8587L47.6704 43.4947C47.9152 43.7187 48.0506 44.0186 48.0476 44.33C48.0445 44.6413 47.9032 44.9392 47.654 45.1594C47.4049 45.3795 47.0679 45.5044 46.7155 45.5071C46.3632 45.5098 46.0238 45.3901 45.7703 45.1738L40.5217 40.5354C37.0918 43.1324 32.657 44.4544 28.1479 44.224C23.6388 43.9937 19.406 42.2289 16.3375 39.3C13.2691 36.3712 11.6036 32.5058 11.6905 28.5152C11.7774 24.5245 13.61 20.7187 16.8037 17.8963C19.9975 15.0739 24.304 13.4544 28.8198 13.3776C33.3356 13.3008 37.7095 14.7726 41.0238 17.4843C44.338 20.1959 46.335 23.9366 46.5956 27.9214C46.8563 31.9061 45.3603 35.8252 42.4217 38.8563V38.8587ZM29.1562 41.8749C33.0765 41.8749 36.8361 40.4987 39.6081 38.049C42.3802 35.5993 43.9375 32.2768 43.9375 28.8124C43.9375 25.3481 42.3802 22.0256 39.6081 19.5759C36.8361 17.1262 33.0765 15.7499 29.1562 15.7499C25.236 15.7499 21.4763 17.1262 18.7043 19.5759C15.9323 22.0256 14.375 25.3481 14.375 28.8124C14.375 32.2768 15.9323 35.5993 18.7043 38.049C21.4763 40.4987 25.236 41.8749 29.1562 41.8749Z"
                  fill="black"
                />
              </svg>
            </div>
            <p className="text-[25px] font-GothamPro font-light text-white lg:text-[20px] md:text-[17px]">
              Открывай для себя новое с удобным поиском
            </p>
          </aside>
          <aside className="flex gap-[36px] items-center mt-[30px] ml-[22px] md:gap-[20px] md:ml-[0px]">
            {/* ДИВ ПОД СВГ ЭЛЕМЕНТ ЧТОБЫ НЕ СДАВЛИВАЛО!!!! */}
            <div className="">
              <svg
                className="lg:max-w-[50px] h-full md:max-w-[40px]"
                width="60"
                height="60"
                viewBox="0 0 60 60"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="30" cy="29.9999" r="30" fill="#054ade" />
                <g clip-path="url(#clip0_0_1)">
                  <path
                    d="M47.2223 24.7222H37.6667C37.0331 24.7222 36.4255 24.9446 35.9775 25.3405C35.5295 25.7364 35.2778 26.2734 35.2778 26.8333V42.6666C35.2778 43.2265 35.5295 43.7635 35.9775 44.1594C36.4255 44.5553 37.0331 44.7777 37.6667 44.7777H47.2223C47.8558 44.7777 48.4635 44.5553 48.9115 44.1594C49.3595 43.7635 49.6112 43.2265 49.6112 42.6666V26.8333C49.6112 26.2734 49.3595 25.7364 48.9115 25.3405C48.4635 24.9446 47.8558 24.7222 47.2223 24.7222ZM47.2223 26.8333V40.5555H37.6667V26.8333H47.2223Z"
                    fill="black"
                  />
                  <path
                    d="M42.4445 15.2222H13.7778C13.1442 15.2222 12.5366 15.4446 12.0886 15.8405C11.6406 16.2364 11.3889 16.7734 11.3889 17.3333V34.2222C11.3889 34.7821 11.6406 35.319 12.0886 35.7149C12.5366 36.1109 13.1442 36.3333 13.7778 36.3333H23.3334V38.4444H20.1322C19.7663 38.4076 19.3984 38.4968 19.1049 38.6933C18.8113 38.8898 18.6146 39.1787 18.5556 39.4999C18.6146 39.8212 18.8113 40.1101 19.1049 40.3066C19.3984 40.5031 19.7663 40.5923 20.1322 40.5555H32.7934V40.1649H32.8889V34.2222H13.7778V17.3333H42.4445V22.6111H44.8334V17.3333C44.8334 16.7734 44.5817 16.2364 44.1337 15.8405C43.6857 15.4446 43.078 15.2222 42.4445 15.2222Z"
                    fill="black"
                  />
                </g>
                <defs>
                  <clipPath id="clip0_0_1">
                    <rect
                      width="43"
                      height="38"
                      fill="white"
                      transform="translate(9 11)"
                    />
                  </clipPath>
                </defs>
              </svg>
            </div>
            <p className="text-[25px] font-GothamPro font-light text-white lg:text-[20px] md:text-[17px]">
              Смотри на любых устройствах
            </p>
          </aside>
          <aside className="flex gap-[36px] items-center mt-[30px] ml-[22px] md:gap-[20px] md:ml-[0px]">
            {/* ДИВ ПОД СВГ ЭЛЕМЕНТ ЧТОБЫ НЕ СДАВЛИВАЛО!!!! */}
            <div className="">
              <svg
                className="lg:max-w-[50px] h-full md:max-w-[40px]"
                width="60"
                height="60"
                viewBox="0 0 60 60"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="30" cy="30" r="30" fill="#054ade" />
                <path
                  d="M12.5833 25.467C12.5833 33.1667 19.7858 37.2691 25.0568 40.9425C26.9166 42.2376 28.7083 43.4584 30.4999 43.4584C32.2916 43.4584 34.0833 42.2392 35.943 40.9409C41.2159 37.2707 48.4166 33.1667 48.4166 25.4686C48.4166 17.7688 38.5624 12.3079 30.4999 19.7116C22.4374 12.3063 12.5833 17.7672 12.5833 25.467Z"
                  fill="black"
                />
              </svg>
            </div>
            <p className="text-[25px] font-GothamPro font-light text-white lg:text-[20px] md:text-[17px]">
              Добавляй в избранное
            </p>
          </aside>
          <aside className="flex gap-[36px] items-center mt-[30px] ml-[22px] md:gap-[20px] md:ml-[0px]">
            {/* ДИВ ПОД СВГ ЭЛЕМЕНТ ЧТОБЫ НЕ СДАВЛИВАЛО!!!! */}
            <div className="">
              <svg
                className="lg:max-w-[50px] h-full md:max-w-[40px]"
                width="60"
                height="60"
                viewBox="0 0 60 60"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="30" cy="30" r="30" fill="#054ade" />
                <path
                  d="M21.0938 19.3125C16.6594 19.3125 13.0312 22.5187 13.0312 26.4375C13.0312 28.7935 14.3441 30.8906 16.349 32.1897C12.8055 33.743 10.3438 36.9635 10.3438 40.6875H13.0312C13.0312 36.7402 16.6271 33.5625 21.0938 33.5625C25.5604 33.5625 29.1562 36.7402 29.1562 40.6875H31.8438C31.8438 36.7402 35.4396 33.5625 39.9062 33.5625C44.3729 33.5625 47.9688 36.7402 47.9688 40.6875H50.6562C50.6562 36.9623 48.1945 33.743 44.651 32.1897C45.677 31.5291 46.5121 30.6639 47.0886 29.6644C47.6651 28.6649 47.9666 27.5593 47.9688 26.4375C47.9688 22.5187 44.3406 19.3125 39.9062 19.3125C35.4719 19.3125 31.8438 22.5187 31.8438 26.4375C31.8438 28.7935 33.1566 30.8906 35.1615 32.1897C33.1982 33.0428 31.5731 34.4011 30.5 36.0859C29.4269 34.4011 27.8018 33.0428 25.8385 32.1897C26.8645 31.5291 27.6996 30.6639 28.2761 29.6644C28.8526 28.6649 29.1541 27.5593 29.1562 26.4375C29.1562 22.5187 25.5281 19.3125 21.0938 19.3125ZM21.0938 21.6875C24.0809 21.6875 26.4688 23.7977 26.4688 26.4375C26.4688 29.0773 24.0809 31.1875 21.0938 31.1875C18.1066 31.1875 15.7188 29.0773 15.7188 26.4375C15.7188 23.7977 18.1066 21.6875 21.0938 21.6875ZM39.9062 21.6875C42.8934 21.6875 45.2812 23.7977 45.2812 26.4375C45.2812 29.0773 42.8934 31.1875 39.9062 31.1875C36.9191 31.1875 34.5312 29.0773 34.5312 26.4375C34.5312 23.7977 36.9191 21.6875 39.9062 21.6875Z"
                  fill="black"
                />
              </svg>
            </div>
            <p className="text-[25px] font-GothamPro font-light text-white lg:text-[20px] md:text-[17px]">
              Делись и обсуждай вместе с друзьями
            </p>
          </aside>
          <aside className="flex gap-[36px] items-center mt-[30px] ml-[22px] md:gap-[20px] md:ml-[0px]">
            {/* ДИВ ПОД СВГ ЭЛЕМЕНТ ЧТОБЫ НЕ СДАВЛИВАЛО!!!! */}
            <div className="">
              <svg
                className="lg:max-w-[50px] h-full md:max-w-[40px]"
                width="60"
                height="60"
                viewBox="0 0 60 60"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="30" cy="30" r="30" fill="#054ade" />
                <path
                  d="M26.6077 17.4778C28.0904 18.6087 29.0944 20.0931 29.6195 21.9309C30.1447 23.7687 30.1292 25.5358 29.5732 27.2322C28.9554 28.759 27.6116 29.5224 25.5419 29.5224C23.4723 29.5224 22.1285 28.7307 21.5107 27.1474C20.8929 25.6206 20.7384 23.9383 21.0473 22.1005C21.3562 20.2627 22.1285 18.7218 23.3641 17.4778C24.5998 16.4599 25.681 16.4599 26.6077 17.4778ZM34.2995 14.509C32.1371 15.4703 31.1177 18.015 31.2413 22.1429C31.7355 26.2709 33.1874 28.3632 35.5969 28.4197C38.6242 27.2888 39.7054 24.2352 38.8404 19.259C38.6551 17.9584 38.1763 16.7992 37.404 15.7813C36.6317 14.7635 35.5969 14.3394 34.2995 14.509ZM49.3124 19.0045C46.7176 18.4956 45.1113 18.9197 44.4935 20.2769C43.8139 21.4644 43.0107 23.7545 42.084 27.1474C41.1572 30.5403 40.0452 33.0001 38.7478 34.5269C37.265 36.1667 35.4579 37.4249 33.3264 38.3014C31.195 39.1779 29.048 39.4465 26.8857 39.1072C24.2909 38.7679 22.3139 37.6087 20.9547 35.6295C20.2133 34.4986 19.3638 32.4629 18.4062 29.5224C17.4486 26.5819 16.4137 24.4614 15.3016 23.1608C13.8189 22.4822 12.6605 22.3126 11.8264 22.6519C10.9924 22.9912 10.3746 23.4153 9.97298 23.9242C9.5714 24.4331 9.32427 25.1824 9.2316 26.172C9.13893 27.1615 9.12348 27.9391 9.18526 28.5045C9.24704 29.07 9.30883 29.5789 9.37061 30.0313V30.201C9.92664 33.3676 10.4518 35.3468 10.946 36.1385C12.9848 40.0403 16.3365 42.8676 21.001 44.6206C25.6655 46.3736 30.2837 46.6563 34.8555 45.4688C39.6745 44.2248 43.6748 41.5812 46.8566 37.538C50.0384 33.4949 51.691 29.0983 51.8146 24.3483C51.8146 21.5209 50.9805 19.7397 49.3124 19.0045Z"
                  fill="black"
                />
              </svg>
            </div>
            <p className="text-[25px] font-GothamPro font-light text-white lg:text-[20px] md:text-[17px]">
              Смотри вместе с друзьями прямо на сайте
            </p>
          </aside>
          <NavLink to="/registration/">
            <a
              href=""
              className="hidden md:block text-center md:mt-[30px] py-[21px] px-[31px] bg-heroGradient text-white text-[16px] font-GothamPro font-light rounded-[50px] hover:scale-110 transition-transform xlbig:mt-[20px]"
            >
              Регистрация
            </a>
          </NavLink>
        </div>
        <div className="relative max-w-[515px] h-auto justify-self-end xl:hidden">
          <img
            className="relative rounded-[30px] z-20 w-full h-[730px] object-cover"
            src={bgJoinUs}
            alt=""
          />
          <img
            className="absolute top-[370px] right-[230px] z-0 xbig:hidden"
            src={shape1}
            alt=""
          />
          <img
            className="absolute top-[160px] right-[230px] z-0 xbig:hidden"
            src={shape2}
            alt=""
          />
        </div>
      </section>
    </main>
  );
};
