import * as React from "react";
import Accordion from "@mui/material/Accordion";
import AccordionSummary from "@mui/material/AccordionSummary";
import AccordionDetails from "@mui/material/AccordionDetails";
import Button from "@mui/material/Button";
import { Header } from "../../components/header/header";
import { Box } from "@mui/material";
import Light from "../../img/AboutUs 2 person/Layt-no-bg.png";
import Ryuk from "../../img/AboutUs 2 person/Ryuk-no-bg.png";
import AudioLight from "../../img/audio/L_Theme.mp3";
import "./faq.css";
import { useRef, useEffect } from "react";
function FAQ() {
  const audioRef = useRef(null);

  useEffect(() => {
    if (audioRef.current) {
      audioRef.current.volume = 0.1; // adjust the volume (optional)
    }
  }, [audioRef]);

  const playSound = () => {
    if (audioRef.current) {
      audioRef.current.play();
    }
  };
  return (
    <>
      <Header />
      <main className="relative">
        <div className="box"></div>
        <div className="absolute top-0 left-0 flex justify-between w-full">
          <img
            onClick={playSound}
            className="h-[800px] object-cover snovka cursor-pointer"
            src={Light}
          ></img>
          <audio ref={audioRef} src={AudioLight} />
          <img className="h-[900px] object-cover" src={Ryuk}></img>
        </div>
        <section className="max-w-[1450px] mx-auto mt-[40px]">
          <h1 className="mainText text-center uppercase font-Bluecurve text-white mb-[40px]">
            Общие правила пользования сайтом
          </h1>
          <Accordion
            sx={{
              backgroundColor: "transparent",
              borderBottom: "1px solid #5662d5",
              boxShadow: "none",
            }}
          >
            <AccordionSummary
              className="bg-transparent"
              expandIcon={
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="28"
                  height="28"
                  fill="#FFFFFF"
                  viewBox="0 0 24 24"
                >
                  <path d="M16.293 9.293 12 13.586 7.707 9.293l-1.414 1.414L12 16.414l5.707-5.707z"></path>
                </svg>
              }
              aria-controls="panel1-content"
              id="panel1-header"
            >
              <h1 className="select-none text-white font-GothamPro text-[21px]">
                Основное положение сайта
              </h1>
            </AccordionSummary>
            <AccordionDetails
              sx={{
                color: "white",
                fontFamily: "Gotham Pro",
                fontSize: 18,
                fontWeight: "light",
                display: "flex",
                gap: 2,
                flexDirection: "column",
                justifyContent: "space-between",
              }}
            >
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[30px] h-auto">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    width="100%"
                    height="100%"
                    viewBox="0 0 48 48"
                  >
                    <path
                      fill="#d50000"
                      d="M37,13L29,3l5.5,10L25,22V5l1-2l-1.5,0.5L24,1l-0.5,2.5L22,3l1,2v17l-9.5-9L19,3l-8,10l11,10.5L11,34	l12,12l1,1l1-1l12-12L26,23.5L37,13z M14.5,34l8.5-8.5v17.447L14.5,34z M33.5,34L25,42.947V25.5L33.5,34z"
                    ></path>
                  </svg>
                </div>
                Попытки осознанной ложной интерпретации и/или обход и/или
                злоупотребления недочётами правил недопустимы и в большинстве
                случаев караются блокировкой аккаунта
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[30px] h-auto">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    width="100%"
                    height="100%"
                    viewBox="0 0 48 48"
                  >
                    <path
                      fill="#d50000"
                      d="M37,13L29,3l5.5,10L25,22V5l1-2l-1.5,0.5L24,1l-0.5,2.5L22,3l1,2v17l-9.5-9L19,3l-8,10l11,10.5L11,34	l12,12l1,1l1-1l12-12L26,23.5L37,13z M14.5,34l8.5-8.5v17.447L14.5,34z M33.5,34L25,42.947V25.5L33.5,34z"
                    ></path>
                  </svg>
                </div>
                Администрация и Модерация платформы оставляют за собой право
                наказывать пользователей в случаях, не указанных в правилах
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[30px] h-auto">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    width="100%"
                    height="100%"
                    viewBox="0 0 48 48"
                  >
                    <path
                      fill="#d50000"
                      d="M37,13L29,3l5.5,10L25,22V5l1-2l-1.5,0.5L24,1l-0.5,2.5L22,3l1,2v17l-9.5-9L19,3l-8,10l11,10.5L11,34	l12,12l1,1l1-1l12-12L26,23.5L37,13z M14.5,34l8.5-8.5v17.447L14.5,34z M33.5,34L25,42.947V25.5L33.5,34z"
                    ></path>
                  </svg>
                </div>
                Администрация оставляет за собой право изменять данные правила с
                оповещением пользователей или без каких-либо уведомлений
              </Box>
            </AccordionDetails>
          </Accordion>
          <Accordion
            sx={{
              backgroundColor: "transparent",
              borderBottom: "1px solid #5662d5",
              boxShadow: "none",
            }}
          >
            <AccordionSummary
              className="bg-transparent"
              expandIcon={
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="28"
                  height="28"
                  fill="#FFFFFF"
                  viewBox="0 0 24 24"
                >
                  <path d="M16.293 9.293 12 13.586 7.707 9.293l-1.414 1.414L12 16.414l5.707-5.707z"></path>
                </svg>
              }
              aria-controls="panel1-content"
              id="panel1-header"
            >
              <h1 className="select-none text-white font-GothamPro text-[21px]">
                Общие правила сайта
              </h1>
            </AccordionSummary>
            <AccordionDetails
              sx={{
                color: "white",
                fontFamily: "Gotham Pro",
                fontSize: 18,
                fontWeight: "light",
                display: "flex",
                gap: 2,
                flexDirection: "column",
                justifyContent: "space-between",
              }}
            >
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                Модераторы вправе удалять всю ветку комментариев. Правила сайта
                так-же распространяются на фоны, аватары и никнеймы
                пользователей. Если они будут нарушать правила сайта, то
                модерация имеет право их удалить и выдать блокировку
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[30px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    width="100%"
                    height="100%"
                    viewBox="0 0 48 48"
                  >
                    <path
                      fill="#d50000"
                      d="M37,13L29,3l5.5,10L25,22V5l1-2l-1.5,0.5L24,1l-0.5,2.5L22,3l1,2v17l-9.5-9L19,3l-8,10l11,10.5L11,34	l12,12l1,1l1-1l12-12L26,23.5L37,13z M14.5,34l8.5-8.5v17.447L14.5,34z M33.5,34L25,42.947V25.5L33.5,34z"
                    ></path>
                  </svg>
                </div>
                Оскорбления{" "}
                <span className="bg-Red900 text-[14px]">(срок от 7 дней)</span>
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                Виды оскорблений:
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Прямые оскорбления личности, родственников человека, этнической
                принадлежности и/или политических взглядов
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Завуалированные оскорбления, а также оскорбления на других
                языках. Пример: «пнх», «муд*к», на другом языке
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Оскорбление вопросом
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[30px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    width="100%"
                    height="100%"
                    viewBox="0 0 48 48"
                  >
                    <path
                      fill="#d50000"
                      d="M37,13L29,3l5.5,10L25,22V5l1-2l-1.5,0.5L24,1l-0.5,2.5L22,3l1,2v17l-9.5-9L19,3l-8,10l11,10.5L11,34	l12,12l1,1l1-1l12-12L26,23.5L37,13z M14.5,34l8.5-8.5v17.447L14.5,34z M33.5,34L25,42.947V25.5L33.5,34z"
                    ></path>
                  </svg>
                </div>
                Бессмысленные сообщения / Флуд / Оффтоп{" "}
                <span className="bg-Red900 text-[14px]">(срок от 1 дня)</span>
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Комментарии, имеющие слабую смысловую нагрузку, мешающие
                обсуждению темы.
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Сообщения, которые можно заменить оценкой комментария. Пример:
                «++++», «Плюсую» и т.п
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Бессмысленный набор символов
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Длинный текст, состоящий из повторяющихся слов, букв, символов
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Чрезмерное или неуместное использование КАПСА
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[30px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    width="100%"
                    height="100%"
                    viewBox="0 0 48 48"
                  >
                    <path
                      fill="#d50000"
                      d="M37,13L29,3l5.5,10L25,22V5l1-2l-1.5,0.5L24,1l-0.5,2.5L22,3l1,2v17l-9.5-9L19,3l-8,10l11,10.5L11,34	l12,12l1,1l1-1l12-12L26,23.5L37,13z M14.5,34l8.5-8.5v17.447L14.5,34z M33.5,34L25,42.947V25.5L33.5,34z"
                    ></path>
                  </svg>
                </div>
                Спойлеры
                <span className="bg-Red900 text-[14px]">(срок от 2 дней)</span>
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                Текст является спойлером, если его содержание является
                преждевременно раскрытой сюжетной информацией и он не скрыт с
                помощью оформления (глазик в редакторе)
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[30px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    width="100%"
                    height="100%"
                    viewBox="0 0 48 48"
                  >
                    <path
                      fill="#d50000"
                      d="M37,13L29,3l5.5,10L25,22V5l1-2l-1.5,0.5L24,1l-0.5,2.5L22,3l1,2v17l-9.5-9L19,3l-8,10l11,10.5L11,34	l12,12l1,1l1-1l12-12L26,23.5L37,13z M14.5,34l8.5-8.5v17.447L14.5,34z M33.5,34L25,42.947V25.5L33.5,34z"
                    ></path>
                  </svg>
                </div>
                Реклама / Спам
                <span className="bg-Red900 text-[14px]">(срок от 14 дней)</span>
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Ссылки/названия или упоминания сайтов-конкурентов в русском
                сегменте
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Призывы идти смотреть на другой сайт
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Призывы перейти, подписаться, проголосовать и т.п
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Реклама услуг/товаров и сторонних ресурсов;.
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[30px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    width="100%"
                    height="100%"
                    viewBox="0 0 48 48"
                  >
                    <path
                      fill="#d50000"
                      d="M37,13L29,3l5.5,10L25,22V5l1-2l-1.5,0.5L24,1l-0.5,2.5L22,3l1,2v17l-9.5-9L19,3l-8,10l11,10.5L11,34	l12,12l1,1l1-1l12-12L26,23.5L37,13z M14.5,34l8.5-8.5v17.447L14.5,34z M33.5,34L25,42.947V25.5L33.5,34z"
                    ></path>
                  </svg>
                </div>
                Провокации / Конфликты
                <span className="bg-Red900 text-[14px]">(срок от 3 дней)</span>
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[30px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    width="100%"
                    height="100%"
                    viewBox="0 0 48 48"
                  >
                    <path
                      fill="#d50000"
                      d="M37,13L29,3l5.5,10L25,22V5l1-2l-1.5,0.5L24,1l-0.5,2.5L22,3l1,2v17l-9.5-9L19,3l-8,10l11,10.5L11,34	l12,12l1,1l1-1l12-12L26,23.5L37,13z M14.5,34l8.5-8.5v17.447L14.5,34z M33.5,34L25,42.947V25.5L33.5,34z"
                    ></path>
                  </svg>
                </div>
                Ненормативная лексика
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <span className="bg-Red900 text-[14px]">
                  (Мы не запрещаем использовать ненормативную лексику, но когда
                  текст состоит только или в основном из мата, комментарий может
                  быть удалён. Внимание: большое количество необоснованной
                  ненормативной лексики будет приравниваться к флуду и
                  блокировке)
                </span>
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[30px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    width="100%"
                    height="100%"
                    viewBox="0 0 48 48"
                  >
                    <path
                      fill="#d50000"
                      d="M37,13L29,3l5.5,10L25,22V5l1-2l-1.5,0.5L24,1l-0.5,2.5L22,3l1,2v17l-9.5-9L19,3l-8,10l11,10.5L11,34	l12,12l1,1l1-1l12-12L26,23.5L37,13z M14.5,34l8.5-8.5v17.447L14.5,34z M33.5,34L25,42.947V25.5L33.5,34z"
                    ></path>
                  </svg>
                </div>
                Непотребный контент
                <span className="bg-Red900 text-[14px]">(срок от 20 дней)</span>
              </Box>
              <Box
                sx={{
                  display: "flex",
                  gap: 1,
                  alignItems: "center",
                }}
              >
                <div className="max-w-[20px] h-auto items-center">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    fill="white"
                    width="100%"
                    height="100%"
                    viewBox="0 0 24 24"
                  >
                    <path d="M 12.542969 2 C 11.007813 2.039063 9.542969 2.375 8.289063 3 C 8.953125 2.9375 9.0625 2.890625 9.6875 2.890625 C 12.082031 2.832031 13.152344 3.617188 14 5 C 14.890625 6.429688 14.859375 8.15625 14.859375 9.585938 C 14.859375 12.972656 16.648438 14 18.433594 14 C 20.351563 14 22 11.902344 22 9.984375 C 21.953125 5.835938 16.914063 2 12.542969 2 Z M 7.875 4 C 7.125 3.984375 6.359375 4.148438 5.726563 4.484375 C 2.035156 6.4375 0.96875 12.621094 3.054688 16.441406 C 3.800781 17.851563 4.816406 18.992188 5.996094 19.824219 C 5.707031 19.417969 5.503906 19.109375 5.191406 18.578125 C 4.347656 17.066406 4.433594 15.332031 5.191406 13.90625 C 5.992188 12.394531 7.414063 11.597656 8.65625 10.929688 C 11.636719 9.375 11.550781 7.195313 10.839844 5.640625 C 10.339844 4.554688 9.125 4.027344 7.875 4 Z M 21.847656 14 C 20.710938 15.855469 18.96875 16.667969 17.359375 16.667969 C 15.621094 16.667969 14.195313 16.042969 12.988281 15.285156 C 10.582031 13.769531 8.261719 14.570313 7.371094 16.132813 C 6.433594 17.738281 7.371094 20.234375 9.066406 21.21875 C 12.632813 23.3125 18.519531 20.949219 20.660156 17.15625 C 21.25 16.167969 21.648438 15.089844 21.847656 14 Z"></path>
                  </svg>
                </div>
                Изображения и видео, содержащие эротику, сцены насилия,
                запрещённые символы и другой подобный контент
              </Box>
            </AccordionDetails>
          </Accordion>
        </section>
      </main>
    </>
  );
}
export default FAQ;
